target/classes/com/lonestarcell/mtn/service/client/soap.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<axis2ns1:RequestSOAPHeader
			xmlns:axis2ns1="http://www.huawei.com.cn/schema/common/v2_1">
			<spId>2560110004722</spId>
			<spPassword>00000000</spPassword>
			<BundleID></BundleID>
			<serviceId>00000000</serviceId>
			<timeStamp>20160520224642</timeStamp>
		</axis2ns1:RequestSOAPHeader>
	</soapenv:Header>
	<soapenv:Body>
		<b2b:processRequest xmlns:b2b="http://b2b.mobilemoney.mtn.zm_v1.0/">
			<serviceId>0000000000000000</serviceId>
			<parameter>
				<name>ProcessingNumber</name>
				<value>19876377</value>
			</parameter>
			<parameter>
				<name>senderID</name>
				<value>MOM</value>
			</parameter>
			<parameter>
				<name>AcctRef</name>
				<value>90099887766</value>
			</parameter>
			<parameter>
				<name>RequestAmount</name>
				<value>150000.0</value>
			</parameter>
			<parameter>
				<name>paymentRef</name>
				<value>0</value>
			</parameter>
			<parameter>
				<name>ThirdPartyTransactionID</name>
				<value>0</value>
			</parameter>
			<parameter>
				<name>MOMAcctNum</name>
				<value>231888210000</value>
			</parameter>
			<parameter>
				<name>CustName</name>
				<value>231888210000</value>
			</parameter>
			<parameter>
				<name>TXNType</name>
				<value></value>
			</parameter>
			<parameter>
				<name>StatusCode</name>
				<value></value>
			</parameter>
			<parameter>
				<name>OpCoID</name>
				<value></value>
			</parameter>
			<parameter>
				<name>Cur</name>
				<value>LRD</value>
			</parameter>
		</b2b:processRequest>
	</soapenv:Body>
</soapenv:Envelope>